# TableCellStyleOverrideOptions Methods

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
TableCellStyleOverrideOptions Methods
TableCellStyleOverrideOptions Class See Also
---
The TableCellStyleOverrideOptions type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Dispose |
| Equals | Determines whether the specified Object is equal to the current Object. (Inherited from Object.) |
| GetHashCode | Serves as a hash function for a particular type.  (Inherited from Object.) |
| GetType | Gets the Type of the current instance. (Inherited from Object.) |
| SetAllOverrides | Sets all overrides to a specific value. |
| ToString | Returns a string that represents the current object. (Inherited from Object.) |

# See Also
TableCellStyleOverrideOptions Class
Autodesk.Revit.DB Namespace